// api集中管理
export default {
	// 注册
	register_url:'/api/create_without_token/user/',
	
	//登录
	login_url:'/api/login/user-password/',
	
	//退出登录
	logout_url:'/api/login/user-logout/',
	
	//数据字典
	dictionary_url:'/api/get/sub_power/',
	
	//--------------------首页接口--------------------
	
	
	//--------------------发布需求页接口--------------------
	
	
	//--------------------寻找创客页接口--------------------
	
	
	//--------------------寻找任务页接口--------------------
	
	
	//--------------------成功案例页接口--------------------
	
	
	//--------------------消息页接口--------------------
	
	
	//--------------------个外信息页接口--------------------
	// 修改用户信息时读取回来用户信息数据的接口
	userinfo_url:'/api/get/user/',
	// 修改用户信的接口
	userinfopatch_url:'/api/patch/user/',
}